# read design
read_verilog hwd/dftm.v 
hierarchy -check

# high-level synthesis
proc; opt; fsm; opt; memory; opt
show
write_verilog hwd/synth.v